Tekla Open API Reference for Tekla Structures 2025
RebarGeometry.Diameter Property
The diameter of the wire.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Diameter { get; }
Public ReadOnly Property Diameter As Double
	Get
Property Value
Type: Double
See Also
Reference
RebarGeometry Class
Tekla.Structures.Model Namespace